uploads/xml/Travelport-Request-65ca2d34cad69-3883.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header/>
  <soapenv:Body>
    <air:LowFareSearchReq xmlns:air="http://www.travelport.com/schema/air_v51_0" xmlns:com="http://www.travelport.com/schema/common_v51_0" SolutionResult="false" TargetBranch="P3763969" TraceId="82832e8298ffcaabaf99e529a4bd9104">
      <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
      <air:SearchAirLeg>
        <air:SearchOrigin>
          <com:CityOrAirport Code="TIP"/>
        </air:SearchOrigin>
        <air:SearchDestination>
          <com:CityOrAirport Code="DAC"/>
        </air:SearchDestination>
        <air:SearchDepTime PreferredTime="2024-02-13">
          <com:SearchExtraDays DaysBefore="3" DaysAfter="3"/>
        </air:SearchDepTime>
        <air:AirLegModifiers>
          <air:PermittedCabins>
            <com:CabinClass Type="Economy"/>
          </air:PermittedCabins>
        </air:AirLegModifiers>
      </air:SearchAirLeg>
      <air:AirSearchModifiers>
        <air:PreferredProviders>
          <com:Provider Code="1G"/>
        </air:PreferredProviders>
      </air:AirSearchModifiers>
      <com:SearchPassenger Code="ADT" Age="30"/>
      <air:AirPricingModifiers CurrencyType="SAR"/>
    </air:LowFareSearchReq>
  </soapenv:Body>
</soapenv:Envelope>
